Pandas 02 - Pemilihan baris (rows selection) pada Data Frame

Import Modules

In [1]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.3.3
2.3.0

Persiapan Data Frame

In [2]:
#Menentukan jumlah baris dan kolom untuk data frame
n_rows = 10
n_cols = 5

#Menentukan label kolom menggunakan tuple 
cols = tuple('ABCDE')

#Membuat data frame dengan nilai acak antara 1 dan 5
df = pd.DataFrame(np.random.randint(1, 5, size=(n_rows, n_cols)), 
                  columns = cols) 

#Menampilkan data frame yang telah dibuat 
df

   A  B  C  D  E
0  2  4  2  3  1
1  1  1  4  4  4
2  1  3  1  3  1
3  2  4  1  1  4
4  1  4  2  3  1
5  1  1  1  1  2
6  2  4  2  1  1
7  4  2  3  4  4
8  4  4  3  2  3
9  1  2  2  4  4

Selection dengan operator logika |

In [3]:
# Memilih baris dalam data frame di mana nilai kolom 'A' sama dengan 1 atau 3
df[(df['A'] == 1) | (df['A'] == 3)]

   A  B  C  D  E
1  1  1  4  4  4
2  1  3  1  3  1
4  1  4  2  3  1
5  1  1  1  1  2
9  1  2  2  4  4

Selection dengan fungsi isin()

In [4]:
# Memilih baris dalam data frame di mana nilai kolom 'A' terdapat dalam daftar [1, 3]
df[df['A'].isin([1, 3])]

   A  B  C  D  E
1  1  1  4  4  4
2  1  3  1  3  1
4  1  4  2  3  1
5  1  1  1  1  2
9  1  2  2  4  4

Mengenal Operator negasi ~
Operator negasi ~ digunakan sebagai operator logika untuk membuat kebalikan dari suatu kondisi.

Ketika digunakan dengan kondisi boolean, ~ akan menghasilkan nilai kebalikan dari kondisi tersebut.

In [5]:
# Memilih baris dalam data frame di mana nilai kolom 'A' tidak terdapat dalam daftar [1, 3]
df[-df['A'].isin([1, 3])]

   A  B  C  D  E
0  2  4  2  3  1
3  2  4  1  1  4
6  2  4  2  1  1
7  4  2  3  4  4
8  4  4  3  2  3